rails/auth-2/music_app/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 2]]
---
    <section class="album-links">
      <% @band.albums.each do |album| %>