rails/views/my_99cats/app/views/cat_rental_requests/new.html.erb

    <option disable selected="-- Choose a Cat --">-- Choose a Cat --</option>
      <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"