rails/views/my_99cats/app/models/cat_rental_request.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 AND (end_date >= '2021-01-10' AND start_date <= '2021-01-15') AND "cat_rental_requests"."id" != $2 AND "cat_rental_requests"."status" = $3  [["cat_id", 2], ["id", 3], ["status", "PENDING"]]
---
  def overlapping_pending_requests
    overlapping_requests.where(status: "PENDING")

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2021-01-05 22:53:04.916151"], ["id", 4]]
---
  def approve!
    raise "Status cannot be changed" if self.status != "PENDING"

    overlapping_pending_requests.each do |request|
      request.update!(status: "DENIED")
    end

    self.status = "APPROVED"
    self.save!

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2021-01-05 22:36:51.840361"], ["id", 3]]
---
  def deny!
    raise "Status cannot be changed" if self.status != "PENDING"
    self.status = "DENIED"
    self.save!