rails/views/my_99cats/app/views/cats/show.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY start_date  [["cat_id", 2]]
---

        <% @cat.cat_rental_requests.order('start_date').each do |request| %>

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 2]]
---

      <% @cat.cat_rental_requests.each do |request| %>