rails/views/my_99cats/app/controllers/cat_rental_requests_controller.rb

  def index
    @cat_rental_requests = CatRentalRequest.all
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests"

  def create
    @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)

    if @cat_rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 3], ["start_date", "2021-01-01"], ["end_date", "2021-01-02"], ["created_at", "2021-01-05 01:41:13.644850"], ["updated_at", "2021-01-05 01:41:13.644850"]]