rails/auth-2/music_app/app/views/tracks/_form.html.erb

  <select id="track-album" name="track[album_id]">
    <% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"