rails/advanced-forms/project/redditonrailse/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64(16)
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "U8Kz_j-M8-WgVV3BO6D68Q"], ["updated_at", "2021-01-28 19:59:37.007124"], ["id", 4]]