rails/auth/my_99cats/app/controllers/cats_controller.rb

  def create
    @cat = current_user.cats.new(cat_params)

    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["birth_date", "2021-01-01"], ["color", "Tabby"], ["name", "asd"], ["sex", "F"], ["description", "  a"], ["created_at", "2021-01-02 23:28:53.580338"], ["updated_at", "2021-01-02 23:28:53.580338"]]

  def edit
    @cat = current_user.cats.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    id = params[:id]
    @cat = current_user.cats.find(params[:id])

    if @cat.nil?
      redirect_to cats_url
    elsif @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "    One old cat for sales\r\n  "], ["updated_at", "2021-01-03 01:20:08.319083"], ["id", 1]]