rails/auth-2/music_app/app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)

    if @album.save
---
INSERT INTO "albums" ("title", "year", "band_id", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asdf"], ["year", 2000], ["band_id", 3], ["live", false], ["created_at", "2021-01-16 23:07:25.487718"], ["updated_at", "2021-01-16 23:07:25.487718"]]

  def show
    @album = Album.find_by(id: params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @album = Album.find_by(id: params[:id])

    if @album.nil?
      redirect_to albums_url
    elsif @album.update_attributes(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "band_id" = $1, "live" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["band_id", 5], ["live", false], ["updated_at", "2021-01-17 20:55:36.310619"], ["id", 2]]

  def edit
    @album = Album.find_by(id: params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]