rails/auth-2/music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "asdfadfsa"], ["created_at", "2021-01-15 22:56:32.785486"], ["updated_at", "2021-01-15 22:56:32.785486"]]
---
  def create
    @band = Band.new(band_params)

    if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @band = Band.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @band = Band.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Cat Sabbathsadfasdf"], ["updated_at", "2021-01-16 00:38:26.123087"], ["id", 1]]
---
  def update
    id = params[:id]
    @band = Band.find_by(id: params[:id])

    if @band.nil?
      redirect_to bands_url
    elsif @band.update_attributes(band_params)