rails/auth-2/music_app/app/controllers/tracks_controller.rb

  def create
    @track = Track.new(track_params)

    if @track.save
---
INSERT INTO "tracks" ("name", "album_id", "ord", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asdf"], ["album_id", 1], ["ord", 2], ["created_at", "2021-01-17 20:28:14.936281"], ["updated_at", "2021-01-17 20:28:14.936281"]]

  def show
    @track = Track.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def edit
    @track = Track.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @track = Track.find_by(id: params[:id])

    if @track.nil?
      redirect_to tracks_url
    elsif @track.update_attributes(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tracks" SET "name" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["name", "22"], ["updated_at", "2021-01-17 21:13:58.719483"], ["id", 2]]