rails/auth-2/music_app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "tigerlily1419@gmail.com"], ["password_digest", "$2a$12$g2oE0XAkOtS3mdp9yxSwdu6VM0Sq0S198bjM7uEgZKqJYdI9.YsbO"], ["session_token", "CjNK1wTlmLN9ZHFk-_xppg"]]