rails/testing/mygoalsapp/app/views/users/index.html.erb

<section class="user_index">
  <% User.all.each do |user| %>
---
SELECT "users".* FROM "users"