rails/testing/mygoalsapp/app/views/users/show.html.erb

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", "1"]]
---

  <%= @user.goals.each do |goal| %>