rails/auth-2/music_app/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 2]]
---

<% if @album.tracks.length > 0 %>