rails/testing/mygoalsapp/app/controllers/goals_controller.rb

  def create
    @goal = Goal.new(goal_params)
    @goal.author = current_user

    if @goal.save
---
INSERT INTO "users" ("password_digest", "session_token", "created_at", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "goals" ("title", "user_id", "description") VALUES ($1, $2, $3) RETURNING "id"  [["title", "asdf"], ["user_id", "1"], ["description", "asdf"]]