rails/testing/mygoalsapp/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("password_digest", "session_token", "created_at", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @user = User.find_by(id: params[:id])
    if @user.nil?
      render :new
    elsif @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "linusoldman2"], ["password_digest", "$2a$12$KYbmO8VZVXucrhLm24Drt.vf51o9Bw89QmsnGqVe4j8eRWBWf73vG"], ["updated_at", "2021-01-20 00:54:59.619354"], ["id", 10]]