rails/auth-2/music_app/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.session_token.save
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "6h8hs7FiUcMHgM9NflutoA"], ["id", 2]]

  def find_by_credentials(email, password)
    user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "tigerlily1419"], ["LIMIT", 1]]