rails/auth/my_99cats/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "3RUtwsnb0dAqpCDcQx1KLQ"], ["updated_at", "2021-01-12 22:43:34.917960"], ["id", 4]]
---
  def reset_session_token!
    self.session_token = SecureRandom.base64(16)
    self.save!

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "calliecat"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    user = User.find_by(username)