rails/advanced-forms/project/redditonrailse/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.author = current_user

    if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "post_id") VALUES ($1, $2, $3) RETURNING "id"  [["body", "asdfasdf"], ["user_id", 1], ["post_id", 2]]

  def show
    @comment = Comment.find_by(id: params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]