rails/advanced-forms/project/redditonrailse/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdfasd"], ["content", "adfasdf"], ["user_id", 1], ["created_at", "2021-01-29 23:17:26.228328"], ["updated_at", "2021-01-29 23:17:26.228328"]]
---
  def create
    @post = Post.new(post_params)
    @post.author = current_user
    puts "asdfasdfasdfasdfasdfasdfafd"
    puts current_user

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @post = Post.find_by(id: params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    id = params[:id]
    @post = Post.find_by(id: params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "subs".* FROM "subs"
---
  def show
    @post = Post.find_by(id: params[:id])
    if @post
      @subs = Sub.all