rails/advanced-forms/project/redditonrailse/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)
    @post.moderator = current_user

    if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "adsf"], ["description", "ad"], ["moderator_id", 1]]

  def edit
    @sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @sub = Sub.find_by(id: params[:id])
    @posts = Post.all
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"