rails/advanced-forms/project/redditonrailse/app/views/posts/_form.html.erb

SELECT "subs".* FROM "subs"
---

      <% Sub.all.each do |sub| %>