rails/advanced-forms/project/redditonrailse/app/views/posts/show.html.erb

SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 2]]
---
  <ul>
    <% @post.subs.each do |sub| %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 7]]
---
    <% parent_comment = @post.comments.where(parent_comment_id: nil) %>
    <% @post.comments.each do |comment| %>