rails/testing/mygoalsapp/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "rsplO9fTSbcNRAPq2dljng"], ["updated_at", "2021-01-21 03:27:39.291464"], ["id", 1]]